# ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
# ▒▒▒▗▉████████████▅▒▒▒▒▒▗██████████▄▒▒▒▄█████████▖▒▒▒▒▒▒▒▒▒▅████████▄▒▒▒▒▒▒▒▒▒▒
# ▒▒▒▝██████████████▒▒▒▒▒███████████▀▒▒▒███▒▒▒▒▒▒███▒▒▒▒▒▒▒██▘▒▒▒▒▒▒▝██▒▒▒▒▒▒▒▒
# ▒▒▒▒▒▒▒▒▒▒▒▒▒▒███▘▒▒▒▒▒███▒▒▒▒▒▒▒▒▒▒▒▒███▒▒▄█▄▒▒███▒▒▒▒███▘▒▒▒██▒▒▒▝███▒▒▒▒▒▒▒
# ▒▒▒▒▒▒▒▒▒▒▒▒▒███▘▒▒▒▒▒▒███▒▒▒▒▒▒▒▒▒▒▒▒███▒▒███▒▒███▒▒▒███▒▒▒▅████▄▒▒▒███▒▒▒▒▒▒
# ▒▒▒▒▒▒▒▒▒▒▒▒███▘▒▒▒▒▒▒▒███▒▒▒▒▒▒▒▒▒▒▒▒███▒▒▀█▀▒▒███▒▒▒███▒▒▒██████▒▒▒███▒▒▒▒▒▒
# ▒▒▒▒▒▒▒▒▒▒▒███▘▒▒▒▒▒▒▒▒███▒▒▒▒▒▒▒▒▒▒▒▒███▒▒▒▒▒▒███▒▒▒▒███▒▒▒██████▒▒▒███▒▒▒▒▒▒
# ▒▒▒▒▒▒▒▒▒▒███▘▒▒▒▒▒▒▒▒▒█████████▖▒▒▒▒▒██████████▀▒▒▒▒▒███▒▒▒██████▒▒▒███▒▒▒▒▒▒
# ▒▒▒▒▒▒▒▒▒███▘▒▒▒▒▒▒▒▒▒▒█████████▘▒▒▒▒▒███████▀▀▀▒▒▒▒▒▒███▒▒▒██████▒▒▒███▒▒▒▒▒▒
# ▒▒▒▒▒▒▒▒███▘▒▒▒▒▒▒▒▒▒▒▒███▒▒▒▒▒▒▒▒▒▒▒▒███▒▒▒███▒▒▒▒▒▒▒███▒▒▒██████▒▒▒███▒▒▒▒▒▒
# ▒▒▒▒▒▒▒██▉▘▒▒▒▒▒▒▒▒▒▒▒▒███▒▒▒▒▒▒▒▒▒▒▒▒███▒▒▒▒███▒▒▒▒▒▒███▒▒▒██████▒▒▒███▒▒▒▒▒▒
# ▒▒▒▒▒▒███▘▒▒▒▒▒▒▒▒▒▒▒▒▒███▒▒▒▒▒▒▒▒▒▒▒▒███▒▒▒▒▒███▒▒▒▒▒▒███▒▒▒████▒▒▒███▒▒▒▒▒▒▒
# ▒▒▒▒▒███▘▒▒▒▒▒▒▒▒▒▒▒▒▒▒███▒▒▒▒▒▒▒▒▒▒▒▒███▒▒▒▒▒▒███▒▒▒▒▒▒██▄▒▒▒██▒▒▒▄██▒▒▒▒▒▒▒▒
# ▒▒▒▗███████████████▅▒▒▒███████████▄▒▒▒███▒▒▒▒▒▒▒███▒▒▒▒▒▒██▖▒▒▒▒▒▒▗██▒▒▒▒▒▒▒▒▒
# ▒▒▒▀███████████████▀▒▒▒▝██████████▀▒▒▒███▒▒▒▒▒▒▒▒███▒▒▒▒▒▒▒▀███████▀▒▒▒▒▒▒▒▒▒▒
# ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
# 𝐃𝐞𝐩𝐥𝐨𝐲𝐞𝐝 𝐒𝐮𝐜𝐜𝐞𝐬𝐬𝐟𝐮𝐥𝐥𝐲 
# (𝐂) 𝟐𝟎𝟐𝟒-𝟐𝟎𝟐𝟓 𝐛𝐲: @ToxVeGa
# (𝐂) 𝟐𝟎𝟐𝟒-𝟐𝟎𝟐𝟓 𝐛𝐲: @TopVeGa

from FallenMusic import BOT_NAME

PM_START_TEXT = """

◍ ＳＯＵＲＣＥ ＤＲＡＣＵＬＡ ♪
╮⦿ مرحبـا عزيزي : {0}
│᚜⦿ استطيع تشغيل الاغاني فالكول
│᚜⦿ واعمل علي حـمايه الجروبـات
╯⦿ مع بعض المميزات اكتب مميزات

"""

START_TEXT = """
╮⦿ أهـلا بك : {0}
╯⦿ استطيع تشغيل الاغاني بدون تهنيج 🎶

╮⦿ البوت يعمل علي سيرفر سريع 🎧
╯⦿ استطيع حمايه مجموعتك من الإسبام 🔰
‌‌‏
"""

HELP_TEXT = f"""
<u>⦿ **الاوامر في بوت  :**</u>

⦿  اليك قائمة اوامر التشغيل في الجروب

╮⦿  لتشغيل اغنيه  : تشغيل 
│᚜⦿ لتشغيل فيديو  : فيديو
│᚜⦿ لأنهاء الاغنيه  : ايقاف أو قف
│᚜⦿ لايقاف الاغنيه مؤقت  :  كتم أو اسكت
│᚜⦿ لتكملة الاغنيه من الايقاف المؤقت : كمل أو الغاء الكتم
│᚜⦿ لتخطي الاغنيه  : تخطي أو التالي
│᚜⦿ لمعرفه سرعه تشغيل البوت : بنج
│᚜⦿ لتحميل اغنيه من اليوتيوب : تحميل
│᚜⦿ للبحث عن موسيقي أو اغنيه: بحث 
╯⦿  لمعرفه مطورين البوت : المطورين
"""

HELP_SUDO = f"""
<u>⦿ **اوامر المطور  :**</u>

⦿  اليك قائمة اوامر المطور

╮⦿  لمعرفه عدد الكول في البوت : المكالمات
│᚜⦿ لتشغيل على محطة البوت : /eval
│᚜⦿ لمعرفه سرعه السيرفر : فحص
│᚜⦿ لعرض احصائيات السيرفر : الاحصائيات 
│᚜⦿ لتغير اسم الحساب المساعد : /اسم
│᚜⦿ لتغير بايو الحساب المساعد : /بايو
│᚜⦿ لتغير صوره الحساب المساعد : /صورة
│᚜⦿ لحذف صوره الحساب المساعد : /مسح
╯⦿  قائمه أوامر المطورين 🥀
"""

HELP_DEV = f"""
<u>⦿ **اوامر المالك  :**</u>

⦿  اليك قائمة مالك البوت 

╮⦿  لجلب فارات تنصيب البوت : الفارات
│᚜⦿ لعمل اذاعه في البوت : اذاعه
│᚜⦿  لمسح التخزين المؤقت : تنظيف
│᚜⦿ لرفع مطور في البوت /مطور + اليورز 
│᚜⦿ لتنزيل مطور في البوت /تنزيل + اليوزر
╯⦿  قائمه أوامر المالك 🕷️
"""
